Titanic Ödevi - Ödev 2
- Sena Gürkan

In [1]:
import pandas as pd
import numpy as np

# Titanic veri setini oku
df = pd.read_csv("titanic.csv")

# İlk 5 satıra bakalım
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# Veri seti yapısı ve eksik değer bilgileri
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
# Sütunların istatistiksel özet bilgileri
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

1- Kazada ölenlerin yaş ortalamasını bulunuz

In [4]:
# Kazada ölenlerin yaş ortalaması
df[df["Survived"] == 0]["Age"].mean()

30.62617924528302

2- Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [5]:
# Kazada ölenlerin bilet fiyatlarının ortalama ve medyanı
olenler = df[df["Survived"] == 0]

ortalama_fiyat = olenler["Fare"].mean()
medyan_fiyat = olenler["Fare"].median()

print("Ortalama Bilet Fiyatı:", ortalama_fiyat)
print("Medyan Bilet Fiyatı:", medyan_fiyat)

Ortalama Bilet Fiyatı: 22.117886885245902
Medyan Bilet Fiyatı: 10.5

3- Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [6]:
# Kazada ölen erkeklerin yaş ortalaması
olen_erkekler = df[(df["Survived"] == 0) & (df["Sex"] == "male")]

ortalama_yas_erkek = olen_erkekler["Age"].mean()

print("Kazada ölen erkeklerin yaş ortalaması:", ortalama_yas_erkek)

Kazada ölen erkeklerin yaş ortalaması: 31.618055555555557

4- Kazada ölen Kadınların yaş ortalamasını bulunuz

In [7]:
# Kazada ölen kadınların yaş ortalaması
olen_kadinlar = df[(df["Survived"] == 0) & (df["Sex"] == "female")]

ortalama_yas_kadin = olen_kadinlar["Age"].mean()

print("Kazada ölen kadınların yaş ortalaması:", ortalama_yas_kadin)

Kazada ölen kadınların yaş ortalaması: 25.046875

5- Kazadan kurtulanların yaş ortalamasını bulunuz

In [8]:
# Kazadan kurtulanların yaş ortalaması
kurtulanlar = df[df["Survived"] == 1]

ortalama_yas_kurtulan = kurtulanlar["Age"].mean()

print("Kazadan kurtulanların yaş ortalaması:", ortalama_yas_kurtulan)

Kazadan kurtulanların yaş ortalaması: 28.343689655172415

6- Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [9]:
# Kazadan kurtulanların bilet fiyatlarının ortalaması
kurtulanlar = df[df["Survived"] == 1]

ortalama_fiyat_kurtulan = kurtulanlar["Fare"].mean()

print("Kazadan kurtulanların bilet fiyatı ortalaması:", ortalama_fiyat_kurtulan)

Kazadan kurtulanların bilet fiyatı ortalaması: 48.39540760233918

7- Kazadan kurtulan toplam kişi sayısını bulunuz… (tüyo: len(df_titanic[(df_titanic.Survived==1)] kodu ile de bu sayıya ulaşabilirsiniz.)

In [10]:
# Kazadan kurtulan toplam kişi sayısı
kurtulan_sayi = len(df[df["Survived"] == 1])

print("Kazadan kurtulan kişi sayısı:", kurtulan_sayi)

Kazadan kurtulan kişi sayısı: 342

8- 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [11]:
# 10 yaşından küçük yolcuların bilet fiyatlarının medyanı
cocuklar = df[df["Age"] < 10]

medyan_fiyat_cocuk = cocuklar["Fare"].median()

print("10 yaşından küçüklerin bilet fiyatı medyanı:", medyan_fiyat_cocuk)

10 yaşından küçüklerin bilet fiyatı medyanı: 27.0

9- 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

In [12]:
# Her sınıf için ortalama ve medyan bilet fiyatı
sinif_karsilastirma = df.groupby("Pclass")["Fare"].agg(["mean", "median"])

print(sinif_karsilastirma)

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

10- Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

In [13]:
# Toplam kadın ve erkek sayısı
toplam_kadin = len(df[df["Sex"] == "female"])
toplam_erkek = len(df[df["Sex"] == "male"])

# Ölen kadın ve erkek sayısı
olen_kadin = len(df[(df["Sex"] == "female") & (df["Survived"] == 0)])
olen_erkek = len(df[(df["Sex"] == "male") & (df["Survived"] == 0)])

# Oran hesaplaması
oran_kadin = olen_kadin / toplam_kadin
oran_erkek = olen_erkek / toplam_erkek

print("Kazada ölen kadın oranı:", oran_kadin)
print("Kazada ölen erkek oranı:", oran_erkek)

Kazada ölen kadın oranı: 0.25796178343949044
Kazada ölen erkek oranı: 0.8110918544194108